src/Catalogs/Сделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сделки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформацииЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПривлечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыПривлечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПривлеченияЗначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Мессенджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Необходим для конвертации бизнес-процессов в сделки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсЛечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КурсыЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лечение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланЛечения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущийПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксСинхронизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Comment>Специализация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСделки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапУспеха</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияИзмененияЭтапов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходСЭтапа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходНаЭтап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/РезультатыСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РезультатыСделок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Успех</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВидыСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыСделок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСделки</Name>
					<Comment>Не используется</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЭтапаУспех</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЭтапаОтказ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктурныеЕдиницыПрименения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтатусыПациентовПрименения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатусПациента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПричиныОтказов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПричинаОтказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныОтказов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Сделки/Forms/ФормаРезультатаСделки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Сделка"					, ЭтотОбъект.Сделка);
	Параметры.Свойство("Контрагент"				, ЭтотОбъект.Контрагент);
	Параметры.Свойство("ИмяЗавершающегоЭтапа"	, ЭтотОбъект.ИмяЗавершающегоЭтапа);
	
	Если Параметры.Свойство("ИдентификаторСделки") Тогда
		ЭтотОбъект.Сделка	 = Справочники.Сделки.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметры.ИдентификаторСделки));
		ПолучатьКлиента		 = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Сделка) Тогда
		// Закешируем данные сделки
		ИменаПолей = "ВидСделки, ЭтапСделки, ЭтапОтказа, РезультатСделки, ПричинаОтказа, Наименование" + ?(ПолучатьКлиента = Истина, ", Контрагент", "");
		СтруктураОсновныхРеквизитов = ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(ЭтотОбъект.Сделка, ИменаПолей);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураОсновныхРеквизитов);
		ЭтаФорма.Заголовок = СтруктураОсновныхРеквизитов.Наименование;		
	КонецЕсли;
	
	ЭтоПервичныйПовторныйПациент = ВидСделки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты");
	
	Если ИмяЗавершающегоЭтапа = "Успех" Тогда 
		Элементы.ГруппаУспешноОтказ.Видимость  = Ложь;
		Элементы.ГруппаПричинаОтказа.Видимость = Ложь;
		Элементы.ГруппаРеализация.Видимость    = Истина;
	ИначеЕсли ИмяЗавершающегоЭтапа = "Отказ" Тогда 
		Элементы.ГруппаУспешноОтказ.Видимость  = Ложь;
		Элементы.ГруппаПричинаОтказа.Видимость = Истина;
		Элементы.ГруппаРеализация.Видимость    = Ложь;
		УправлениеИнтерфейсамиСервер.ЗаполнитьТаблицуПричинОтказов(ЭтаФорма, ВидСделки, ПричиныПредопределены);
	Иначе
		СтруктураНаименований = Справочники.ВидыСделок.ПолучитьНаименованияЗавершающихЭтаповСделки(ЭтотОбъект.Сделка);
		Элементы.РезультатСделкиУспешно.Заголовок 	= СтруктураНаименований.НаименованиеЭтапаУспех;
		Элементы.РезультатСделкиОтказ.Заголовок 	= СтруктураНаименований.НаименованиеЭтапаОтказ;
	КонецЕсли;
	
	//ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// Процедура, обработчик события "СписокПричинОтказаВыбор".
//
Процедура СписокПричинОтказаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РезультатЗакрытия = СписокПричинОтказаВыборНаСервере(ВыбраннаяСтрока);
	ЭтаФорма.Закрыть(РезультатЗакрытия);

КонецПроцедуры

&НаСервере
// Процедура, продолжение обработчика события на сервере "СписокПричинОтказаВыбор".
//
Функция СписокПричинОтказаВыборНаСервере(ВыбраннаяСтрока)
		
	ПредставлениеВыбранногоЗначения = ЭтотОбъект.ПричиныОтказов[ВыбраннаяСтрока].Значение;
	РезультатФормы = Новый Структура();
	РезультатФормы.Вставить("РезультатСделки"	, Перечисления.РезультатыСделок.Отказ);
	РезультатФормы.Вставить("ПричинаОтказа"		, ПредставлениеВыбранногоЗначения);
	РезультатФормы.Вставить("ЭтапСделки"		, Справочники.ЭтапыСделок.Отказ);
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ЭтапОтказа) Тогда
		РезультатФормы.Вставить("ЭтапОтказа", ЭтотОбъект.ЭтапСделки);
	КонецЕсли;
	
	Возврат РезультатФормы;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды "РезультатСделкиУспешно".
//
Процедура РезультатСделкиУспешно(Команда)
	
	Элементы.ГруппаУспешноОтказ.Видимость  = Ложь;
	Элементы.ГруппаПричинаОтказа.Видимость = Ложь;
	Элементы.ГруппаРеализация.Видимость    = Истина;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "РезультатСделкиОтказ".
//
Процедура РезультатСделкиОтказ(Команда)
	
	Элементы.ГруппаУспешноОтказ.Видимость  = Ложь;
	Элементы.ГруппаПричинаОтказа.Видимость = Истина;
	Элементы.ГруппаРеализация.Видимость    = Ложь;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события команды "ВыбратьРеализацию".
//
Процедура ВыбратьРеализацию(Команда)
		
	НовоеОповещение = Новый ОписаниеОповещения("ВыбратьПриемЗавершение", ЭтотОбъект);
	
	МассивСделок = Новый Массив();
	МассивСделок.Добавить(ЭтотОбъект.Сделка);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Контрагент"			, ЭтотОбъект.Контрагент);
	ПараметрыФормы.Вставить("ВключатьПакетИЧленство", Истина);
	ПараметрыФормы.Вставить("РеализацияБезСделки"	, Истина);
	ПараметрыФормы.Вставить("МассивСделок"			, МассивСделок);
	
	ОткрытьФорму("Документ.Прием.ФормаВыбора",ПараметрыФормы,,,,,НовоеОповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// Процедура, ВыбратьПриемЗавершение.
//
Процедура ВыбратьПриемЗавершение(Результат, ДопПараметры) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;		
	КонецЕсли;
	
	РезультатЗакрытия = РезультатСделкиУспешноНаСервере(Результат);
	ЭтаФорма.Закрыть(РезультатЗакрытия);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события команды "СоздатьРеализацию".
//
Процедура СоздатьРеализацию(Команда)
	
	Структура = Новый Структура();
	Структура.Вставить("Контрагент"			, ЭтотОбъект.Контрагент);
	Структура.Вставить("Сделка"	   			, ЭтотОбъект.Сделка);
	ПараметрыФормы  = Новый Структура("ЗначенияЗаполнения", Структура);	
	НовоеОповещение = Новый ОписаниеОповещения("СоздатьПриемЗавершение", ЭтотОбъект);
	ОткрытьФорму("Документ.Прием.Форма.ФормаДокумента",ПараметрыФормы,,,,,НовоеОповещение);
	
КонецПроцедуры

&НаКлиенте
// Процедура, СоздатьПриемЗавершение.
//
Процедура СоздатьПриемЗавершение(Результат, ДопПараметры) Экспорт
	
	Прием = ПолучитьПоследнююПриемПоСделке(ЭтотОбъект.Сделка);
	РезультатЗакрытия = Неопределено;
	Если ЗначениеЗаполнено(Прием) Тогда
		РезультатЗакрытия = РезультатСделкиУспешноНаСервере(Прием);
	КонецЕсли;
	
	ЭтаФорма.Закрыть(РезультатЗакрытия);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура, продолжение обработчика события на сервере "РезультатСделкиУспешно".
//
Функция РезультатСделкиУспешноНаСервере(Прием = Неопределено)
	
	Результат = Новый Структура();
	Результат.Вставить("РезультатСделки"	, Перечисления.РезультатыСделок.Успех);
	Результат.Вставить("ЭтапУспеха"			, ЭтотОбъект.ЭтапСделки);
	Результат.Вставить("ЭтапСделки"			, Справочники.ЭтапыСделок.Успех);
	Результат.Вставить("ПричинаОтказа"		, Неопределено);
	Результат.Вставить("Прием"				, Прием);
	
	Возврат Результат;	

КонецФункции

&НаСервере
// Процедура, заполняет список значений формы "ПричиныОтказов".
//
Процедура ЗаполнитьПричиныОтказа()
	
	ЭтотОбъект.ПричиныОтказов.Очистить();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПричиныОтказов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПричиныОтказов КАК ПричиныОтказов
	|ГДЕ
	|	НЕ ПричиныОтказов.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПричиныОтказов.Наименование");
	
	ЭтотОбъект.ПричиныОтказов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, ПолучитьПоследнююПриемПоСделке.
//
Функция ПолучитьПоследнююПриемПоСделке(Сделка)
	
	Если НЕ ЗначениеЗаполнено(Сделка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Прием.Ссылка КАК Продажа
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.Сделка = &Сделка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Прием.Дата УБЫВ";
	Запрос.УстановитьПараметр("Сделка", Сделка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗначениеВозврата = ?( Выборка.Следующий(), Выборка.Продажа, Неопределено);
	
	Возврат ЗначениеВозврата;
		
КонецФункции

#КонецОбласти
